revk/ESP32-Flasher/main/Flasher.c
void
upgrade_check (const char *fn, char *url)
{
   if (!fn || !url)
      return;
   const char *filename = fn + sizeof (sd_dir);
   if (!client)
   {
      esp_http_client_config_t config = {
         .url = url,
         .timeout_ms = 30000,
      };
#ifdef  CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
      config.crt_bundle_attach = esp_crt_bundle_attach;
#else
      config.use_global_ca_store = true;        /* Global cert */
#endif
      client = esp_http_client_init (&config);
      if (!client)
         return;
   } else
      esp_http_client_set_url (client, url);
   char *dl = NULL;
   asprintf (&dl, "%s/DOWNLOAD", sd_dir);
   esp_err_t e = 0;
   char *h = NULL;
   struct stat s = { 0 };
   if (!stat (fn, &s) && s.st_mtime)
   {
      struct tm t;
      gmtime_r (&s.st_mtime, &t);
      asprintf (&h, "%.3s, %02d %.3s %4d %02d:%02d:%02d GMT",
                "SunMonTueWedThuFriSat" + t.tm_wday * 3, t.tm_mday,
                "JanFebMarAprMayJunJulAugSepOctNovDec" + t.tm_mon * 3, t.tm_year + 1900, t.tm_hour, t.tm_min, t.tm_sec);
      e = esp_http_client_set_header (client, "If-Modified-Since", h);
   }
   if (!e)
      e = esp_http_client_open (client, 0);
   if (!e)
   {
      esp_http_client_fetch_headers (client);
      int status = esp_http_client_get_status_code (client);
      int len = 0;
      if (status / 100 == 2)
      {
         set_led (100, 'K', 'Y');
         b.fileerror = 1;
         int o = open (dl, O_CREAT | O_TRUNC | O_WRONLY, 0777);
         if (o < 0)
            ESP_LOGE (TAG, "Cannot write %s", dl);
         else
         {
            uint32_t size = 0;
            while (1)
            {
               len = esp_http_client_read_response (client, (void *) block, sizeof (block));
               if (len <= 0)
                  break;
               write (o, block, len);
               size += len;
            }
            close (o);
            if (!e)
               unlink (fn);     // fails if not there, duh
            if (!e && (e = rename (dl, fn)))    // Fails if target there, duh
               ESP_LOGE (TAG, "Rename fail %s", fn);
            if (!e)
            {
               ESP_LOGE (TAG, "Upgraded %s %s %u", filename, url, size);
               b.reload = 1;
            }
         }
      } else
      {
         if (status != 304)
            ESP_LOGE (TAG, "Status %d %s", status, url);
         else
            ESP_LOGE (TAG, "Unchanged %s %s %s (%u)", h ? : "", filename, url, s.st_size);
         while (esp_http_client_read_response (client, (void *) block, sizeof (block)) > 0);    // Yes, not using flush as seems not to actually work
      }
   }
   if (e)
      ESP_LOGE (TAG, "Failed %s: %s", url, esp_err_to_name (e));
   if (h)
      esp_http_client_delete_header (client, "If-Modified-Since");
   free (h);
   free (dl);
}

void
load_cb (char *fn, char *url, int app, uint32_t address, uint32_t size, uint8_t verify)
{
   if (!size)
      manifestsize = -1;
   else if (manifestsize != -1)
      manifestsize += size;
   if (app < 0)
      return;
   int f = open (fn, O_RDONLY);
   if (f < 0)
      return;
   if (lseek (f, app, SEEK_SET) == app)
   {
      esp_app_desc_t app;
      if (read (f, &app, sizeof (app)) == sizeof (app))
      {
         if (!manifestapp)
         {
            manifestapp = strndup (app.project_name, 32);
            b.manifestappprefix = 1;
         }
         if (!manifestversion)
            manifestversion = strndup (app.version, 32);
         if (!manifestbuild)
         {
            char temp[20];
            if (revk_build_date_app (&app, temp))
               manifestbuild = strdup (temp);
         }
      }
   }
   close (f);
}

void
upgrade_cb (char *fn, char *url, int app, uint32_t address, uint32_t size, uint8_t verify)
{
   load_cb (fn, url, app, address, size, verify);
   upgrade_check (fn, url);
}

const char *
manifest_fn (uint8_t m)
{                               // Get manifest filename (static)
   static char temp[50];
   snprintf (temp, sizeof (temp), "%s/manifest%d.json", sd_dir, m);
   return temp;
}

jo_t
read_manifest (uint8_t m)
{                               // Read a manifest
   const char *fn = manifest_fn (m);
   int f = open (fn, O_RDONLY);
   if (f < 0 && *manifesturl[m])
   {
      upgrade_check (fn, manifesturl[m]);
      f = open (fn, O_RDONLY);
   }
   if (f < 0)
      return NULL;
   struct stat s = { 0 };
   fstat (f, &s);
   if (!s.st_size || s.st_size > 10000)
   {                            // Silly
      close (f);
      ESP_LOGE (TAG, "Manifest %d bad size %ld", m, s.st_size);
      return NULL;
   }
   char *mem = malloc (s.st_size);
   if (!mem)
   {
      close (f);
      return NULL;
   }
   if (read (f, mem, s.st_size) != s.st_size)
   {
      close (f);
      free (mem);
      return NULL;
   }
   close (f);
   jo_t j = jo_parse_malloc (mem, s.st_size);
   if (!j)
      return NULL;
   jo_skip (j);
   int pos = 0;
   const char *e = jo_error (j, &pos);
   if (e)
   {
      ESP_LOGE (TAG, "Manifest %d failed: %s at %d", m, e, pos);
      jo_free (&j);
      return NULL;
   }
   jo_rewind (j);
   return j;
}

const char *
load_manifest (void)
{
   close_manifest ();
   free (mname[manifest]);
   mname[manifest] = NULL;
   free (murl[manifest]);
   murl[manifest] = NULL;
   j = read_manifest (manifest);
   if (!j)
      return "Cannot load manifest";
   if (jo_find (j, "name"))
      mname[manifest] = jo_strdup (j);
   if (jo_find (j, "url"))
      murl[manifest] = jo_strdup (j);
   b.manifestappprefix = 0;
#define x(f) free (manifest##f); manifest##f = NULL; if (jo_find (j, #f)) manifest##f = jo_strdup (j);
#define xx(f1,f2) free (manifest##f1##f2); manifest##f1##f2 = NULL; if (jo_find (j, #f1"."#f2)) manifest##f1##f2 = jo_strdup (j);
   fields
#undef x
#undef xx
      jo_type_t t;
   b.erase = flasherase;
   b.nocheck = 1 - flashcheck;
   b.nobtn = 1 - flashbutton;
   atetimeout = flashwait;
   if ((t = jo_find (j, "erase")) >= JO_TRUE)
      b.erase = (t == JO_TRUE ? 1 : 0);
   if ((t = jo_find (j, "button")) >= JO_TRUE)
      b.nobtn = (t == JO_TRUE ? 0 : 1);
   if ((t = jo_find (j, "check")) >= JO_TRUE)
      b.nocheck = (t == JO_TRUE ? 0 : 1);
   if ((t = jo_find (j, "wait")) == JO_NUMBER)
      atetimeout = jo_read_int (j);
   b.voltage3v3 = 0;
   if (jo_find (j, "voltage") == JO_NUMBER)
   {
      int v = round (1000 * jo_read_float (j));
      if (v == 3300)
         b.voltage3v3 = 1;
      else if (v != 5000)
         b.fileerror = 1;
   }
   if (!b.checked && !revk_link_down () && time (0) > 1000000000)
   {                            // Can check for new files
      char *url = NULL;
      if (jo_find (j, "url") == JO_STRING)
         url = jo_strdup (j);
      const char *fn = manifest_fn (manifest);
      if (*manifesturl[manifest])
      {
         upgrade_check (fn, manifesturl[manifest]);
         if (url && !strcasecmp (strchr (url, ':') ? : url, strchr (manifesturl[manifest], ':') ? : manifesturl[manifest]))
         {                      // Yes case for domain really, but close enough - we are using same URL so remove from settings
            char tag[20];
            sprintf (tag, "manifesturl%d", manifest + 1);
            jo_t j = jo_object_alloc ();
            jo_string (j, tag, "");
            revk_setting (j);
            jo_free (&j);
         }
      } else
         upgrade_check (fn, url);
      free (url);
      manifestsize = 0;
      scan_manifest (upgrade_cb);
      if (client)
      {
         esp_http_client_cleanup (client);
         client = NULL;
      }
      if (!b.reload)
         b.checked = 1;
   } else
   {
      manifestsize = 0;
      scan_manifest (load_cb);
   }
   if (manifestsize == -1)
      return "Missing files";
   if (!manifestsize)
      return "No files to flash";
   return NULL;
}

esp_loader_error_t
do_erase (void)
{
   b.forceerase = 0;
   ESP_LOGE (TAG, "Erase whole flash");
   uint32_t p = 0;
   while (p < flashsize && !b.reload)
   {
      set_led (p * 100 / flashsize, 'B', 'K');
      esp_loader_error_t e = esp_loader_flash_erase_region (p, BLOCK);
      if (e)
         return e;
      p += BLOCK;
   }
   return 0;
}

uint32_t flashcount = 0;
esp_loader_error_t flashe = 0;
void
flash_cb (char *fn, char *url, int app, uint32_t address, uint32_t size, uint8_t verify)
{
   if (!fn || flashe || !size)
      return;
   char *filename = fn + sizeof (sd_dir);
   int try = (verify ? : 1);
   while (try--)
   {
      ESP_LOGE (TAG, "Flash to %06X len %06X %s", address, size, filename);
      int f = open (fn, O_RDONLY);
      if (f < 0)
      {
         ESP_LOGE (TAG, "Missing %s", filename);
         return;
      }
      flashe = esp_loader_flash_start (address, size, BLOCK);
      uint32_t p = 0;
      if (!flashe)
      {
         while (p < size)
         {
            set_led (flashcount * 100 / manifestsize, 'K', 'B');
            uint32_t s = read (f, block, BLOCK);
            if (s <= 0)
               break;
            flashe = esp_loader_flash_write (block, s);
            if (flashe)
               break;
            p += s;
            flashcount += s;
         }
      }
      close (f);
      if (!flashe)
         flashe = esp_loader_flash_finish (false);
      if (!flashe && verify)
      {
         flashe = esp_loader_flash_verify ();   // This does not seem to work if flashing to end of flash!
         if (flashe)
         {
            ESP_LOGE (TAG, "Verify fail %06X len %06X %s", address, size, filename);
            if (try)
            {
               flashcount -= p;
               flashe = 0;
               continue;
            }
         }
      }
      if (flashe)
         ESP_LOGE (TAG, "Flash fail %06X len %06X at %06X %s (%d)", address, size, p, filename, flashe);
      break;
   }
}

esp_loader_error_t
do_flash (void)
{
   ESP_LOGE (TAG, "Flash %u bytes", manifestsize);
   flashe = 0;
   flashcount = 0;
   scan_manifest (flash_cb);
   return flashe;
}

void
flash_task (void *arg)
{
   esp_err_t e = 0;
   // SD card set up
   revk_gpio_input (sdcd);
   sdmmc_card_t *card = NULL;
   sdmmc_slot_config_t slot = SDMMC_SLOT_CONFIG_DEFAULT ();
   sdmmc_host_t host = SDMMC_HOST_DEFAULT ();
   slot.clk = sdclk.num;
   slot.cmd = sdcmd.num;
   slot.d0 = sddat0.num;
   slot.d1 = sddat1.set ? sddat1.num : -1;
   slot.d2 = sddat2.set ? sddat2.num : -1;
   slot.d3 = sddat3.set ? sddat3.num : -1;
   slot.width = (sddat2.set && sddat3.set ? 4 : sddat1.set ? 2 : 1);
   if (slot.width == 1)
      slot.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;    // Old boards?
   host.max_freq_khz = SDMMC_FREQ_HIGHSPEED;
   host.slot = SDMMC_HOST_SLOT_1;
   {                            // USB init
      const usb_host_config_t host_config = {
         .skip_phy_setup = false,
         .intr_flags = ESP_INTR_FLAG_LEVEL1,
      };
      cdc_acm_host_driver_config_t usb_config = {
         .driver_task_priority = 10,
         .driver_task_stack_size = 4096,
         .xCoreID = 0,
         .new_dev_cb = device_connect_cb,
      };
      e = usb_host_install (&host_config);
      if (!e)
         e = cdc_acm_host_install (&usb_config);
      if (e)
      {
         ledsd = 'R';
         ESP_LOGE (TAG, "USB init failed %s", esp_err_to_name (e));
         jo_t j = jo_object_alloc ();
         jo_string (j, "error", esp_err_to_name (e));
         jo_int (j, "code", e);
         revk_error ("USB", &j);
      }
   }
   revk_task ("usb-lib", usb_lib_task, NULL, 4);
   // Main loop
   while (!b.die && !revk_shutting_down (NULL))
   {
      ledsd = 'Y';
      ESP_LOGI (TAG, "Waiting SD");
      // Wait for SD card
      while (!revk_gpio_get (sdcd))
      {
         b.checked = 0;
         usleep (100000);
         continue;
      }
      ESP_LOGI (TAG, "Mounting SD");
      // Mount SD card
      esp_vfs_fat_sdmmc_mount_config_t mount_config = {
         .format_if_mount_failed = 1,
         .max_files = 2,
         .allocation_unit_size = 16 * 1024,
         .disk_status_check_enable = 1,
      };
      e = esp_vfs_fat_sdmmc_mount (sd_dir, &host, &slot, &mount_config, &card);
      if (e != ESP_OK)
      {
         ledsd = 'R';
         ESP_LOGE (TAG, "SD mount failed %s", esp_err_to_name (e));
         jo_t j = jo_object_alloc ();
         if (e == ESP_FAIL)
            jo_string (j, "error", "Failed to mount");
         else
            jo_string (j, "error", "Failed to initialise");
         jo_int (j, "code", e);
         revk_error ("SD", &j);
         while (revk_gpio_get (sdcd))
            usleep (100000);
         continue;
      }
      ESP_LOGI (TAG, "Mounted SD");
      ledsd = 'G';
      b.fileerror = 0;
      set_led (manifest * 10, 'Y', 'Y');
      {                         // Check manifests
         manifests = 0;
         for (int i = 0; i < MANIFESTS; i++)
         {
            if (*manifesturl[i])
               manifests |= (1 << i);
            jo_t j = read_manifest (i);
            if (j)
            {
               manifests |= (1 << i);
               if (jo_find (j, "name"))
                  mname[i] = jo_strdup (j);
               if (jo_find (j, "url"))
                  murl[i] = jo_strdup (j);
               jo_free (&j);
            }
         }
      }
      {                         // Manifest
         const char *e = load_manifest ();
         if (e)
         {
            ESP_LOGE (TAG, "Manifest fail: %s", e);
            set_led (manifest * 10, 'R', 'R');
            b.fileerror = 1;
         }
      }

      if (!b.fileerror)
      {
         // TODO how do we do serial via UART?
         ESP_LOGE (TAG, "Power on %s", b.voltage3v3 ? "3.3V" : "5V");
         revk_gpio_output (b.voltage3v3 ? pwr3 : pwr5, 1);      // device on
         usb_host_lib_set_root_port_power (true);
         while (revk_gpio_get (sdcd) && !b.die && !b.reload && !revk_shutting_down (NULL))
         {
            b.fileerror = 0;
            if (badusb && badusb + 2 > uptime ())
               set_led (manifest * 10, 'R', 'R');       // Likely diff device
            else
               set_led (manifest * 10, 'M', 'M');
            if (b.wifi && time (0) > 1000000000)
            {
               ESP_LOGE (TAG, "Online");
               b.wifi = 0;
               revk_command ("upgrade", NULL);
               b.reload = 1;
               continue;
            }
            if (!b.connected)
            {
               usleep (100000);
               continue;
            }
            loader_esp32_usb_cdc_acm_config_t config = {
               .acm_host_error_callback = host_error_cb,
               .device_disconnected_callback = device_disconnect_cb,
               .device_pid = 0x1001,    // USB direct not serial chip...
               .connection_timeout_ms = 1000,
               .out_buffer_size = BLOCK,
               //.acm_host_serial_state_callback = host_serial_cb,
            };
            esp_loader_error_t e = loader_port_esp32_usb_cdc_acm_init (&config);
            if (e)
            {                   // try non JTAG
               config.device_pid = 0;
               loader_port_esp32_usb_cdc_acm_deinit ();
               e = loader_port_esp32_usb_cdc_acm_init (&config);
               if (!e)
                  ESP_LOGE (TAG, "Serial connect");
            } else
               ESP_LOGE (TAG, "JTAG connect");
            if (!e)
            {                   // Connected
               set_led (manifest * 10, 'O', 'O');
               uint8_t status = STATUS_TIMEOUT;
               if (!b.forceerase && !b.erase && !b.nocheck)
               {
                  esp_loader_reset_target ();
                  status = target_status ();
               }
               if (b.connected
                   && (b.forceerase || b.erase || (status != STATUS_PASS && status != STATUS_FAIL)) && status != STATUS_ERROR)
               {
                  ESP_LOGE (TAG, "Bootload");
                  esp_loader_connect_args_t a = ESP_LOADER_CONNECT_DEFAULT ();
                  e = esp_loader_connect_with_stub (&a);        // Some chips don't work with stub
                  if (e)
                  {
                     ESP_LOGE (TAG, "Failed to connect in downloader mode");
                     status = STATUS_ERROR;
                  }
                  if (status != STATUS_ERROR)
                     chip_info ();
                  if (status != STATUS_ERROR && !flashsize)
                  {
                     ESP_LOGE (TAG, "Failed to get chip info");
                     status = STATUS_ERROR;
                  }
                  if (status != STATUS_ERROR && jo_find (j, "chip") == JO_STRING && jo_strcmp (j, chip))
                  {
                     status = STATUS_ERROR;
                     char *c = jo_strdup (j);
                     ESP_LOGE (TAG, "Wrong chip %s expecting %s", chip, c);
                     free (c);
                     b.fileerror = 1;
                  }
                  if ((b.forceerase || b.erase) && status != STATUS_EMPTY && status != STATUS_ERROR && do_erase ())
                  {
                     status = STATUS_ERROR;
                     ESP_LOGE (TAG, "Erase failed");
                  }
                  if (status != STATUS_ERROR && do_flash ())
                  {
                     status = STATUS_ERROR;
                     ESP_LOGE (TAG, "Flash failed");
                  }
                  if (b.connected && !b.reload)
                  {
                     ESP_LOGE (TAG, "Reset");
                     esp_loader_reset_target ();
                     status = target_status ();
                  }
               }
               switch (status)
               {
               case STATUS_MISMATCH:
                  set_led (manifest * 10, 'Y', 'Y');
                  break;
               case STATUS_PASS:
                  set_led (100, 'K', 'G');
                  break;
               case STATUS_FAIL:
                  set_led (100, 'K', 'R');
                  break;
               case STATUS_LOOPING:
                  set_led (90, 'K', 'R');
                  break;
               case STATUS_SILENT:
                  set_led (80, 'K', 'R');
                  break;
               case STATUS_EMPTY:
                  set_led (70, 'K', 'R');
                  break;
               case STATUS_ERROR:
                  b.fileerror = 1;
                  set_led (60, 'K', 'R');
                  break;
               case STATUS_TIMEOUT:
                  set_led (50, 'R', 'G');
                  break;
               default:
                  set_led (manifest * 10, 'R', 'R');
               }
               if (b.connected && !b.reload)
               {
                  ESP_LOGE (TAG, "Wait disconnect");
                  while (revk_gpio_get (sdcd) && b.connected && !b.reload && !revk_shutting_down (NULL))
                     usleep (100000);
               }
            }
            //close_manifest ();
            loader_port_esp32_usb_cdc_acm_deinit ();
         }
         set_led (0, 'K', 'K');
         ESP_LOGE (TAG, "Power off");
         if (b.connected)
            usb_host_lib_set_root_port_power (false);
         revk_gpio_output (pwr3, 0);
         revk_gpio_output (pwr5, 0);
      } else
         sleep (1);
      ESP_LOGI (TAG, "Dismounting SD");
      esp_vfs_fat_sdcard_unmount (sd_dir, card);
      ledsd = 'B';
      b.reload = 0;
   }

   usb_host_uninstall ();
   b.fileerror = 0;
   while (revk_shutting_down (NULL))
   {
      int p = revk_ota_progress ();
      if (p >= 0 && p <= 100)
         set_led (p, 'K', 'Y');
      usleep (100000);
   }
   vTaskDelete (NULL);
}

void
revk_web_extra (httpd_req_t *req, int page)
{
   revk_web_setting (req, NULL, "manifest");
   revk_web_setting_title (req, "URLs for manifest files, overriding the url in the file if different");
   for (int i = 0; i < MANIFESTS; i++)
   {
      char name[30];
      sprintf (name, "manifesturl%d", i + 1);
      char tag[30];
      sprintf (tag, "manifest%d.json", i);
      revk_web_setting_edit (req, tag, name, (manifests & (1 << i)) ? "From file" : NULL);
   }
}

static void
register_uri (const httpd_uri_t *uri_struct)
{
   esp_err_t res = httpd_register_uri_handler (webserver, uri_struct);
   if (res != ESP_OK)
   {
      ESP_LOGE (TAG, "Failed to register %s, error code %d", uri_struct->uri, res);
   }
}

static void
register_get_uri (const char *uri, esp_err_t (*handler) (httpd_req_t *r))
{
   httpd_uri_t uri_struct = {
      .uri = uri,
      .method = HTTP_GET,
      .handler = handler,
   };
   register_uri (&uri_struct);
}

static esp_err_t
web_root (httpd_req_t *req)
{
   static char *temp = NULL;
   size_t len = httpd_req_get_url_query_len (req);
   char q[3] = { };
   if (len && len <= 2)
   {
      httpd_req_get_url_query_str (req, q, sizeof (q));
      jo_t j = jo_object_alloc ();
      jo_int (j, "manifest", atoi (q));
      revk_setting (j);
      jo_free (&j);
      b.checked = 0;
      b.reload = 1;
   }
   int i;
   revk_web_head (req, hostname);
   revk_web_send (req, "<h1>%s</h1><table border=1><tr><th></th><th>Name</th><th>URL</th>", hostname);
   for (i = 0; i < MANIFESTS && !*manifesturl[i]; i++);
   if (i < MANIFESTS)
      revk_web_send (req, "<th>Override</th>");
   revk_web_send (req, "</tr>");
   for (int i = 0; i < MANIFESTS; i++)
      if (manifests & (1 << i))
      {
         revk_web_send (req, "<tr%s><td><a href='?%d'>%d</a></td>", manifest == i ? " style='background:yellow;'" : "", i, i);
         revk_web_send (req, "<td>%s</td>", mname[i] ? revk_web_safe (&temp, mname[i]) : "-");
         revk_web_send (req, "<td>%s</td>", murl[i] ? revk_web_safe (&temp, murl[i]) : "-");
         if (*manifesturl[i])
            revk_web_send (req, "<td>%s</td>", revk_web_safe (&temp, manifesturl[i]));
         revk_web_send (req, "</tr>");
      }
   revk_web_send (req, "</table>");
   return revk_web_foot (req, 0, 1, NULL);
}

//--------------------------------------------------------------------------------
// Main
void
app_main ()
{
   revk_boot (&mqtt_client_callback);
   revk_start ();
   memset (mname, 0, sizeof (mname));
   memset (murl, 0, sizeof (murl));
   // Web interface
   httpd_config_t config = HTTPD_DEFAULT_CONFIG ();
   config.stack_size += 4096;   // Being on the safe side
   // When updating the code below, make sure this is enough
   // Note that we're also adding revk's own web config handlers
   config.max_uri_handlers = 1 + revk_num_web_handlers ();
   if (!httpd_start (&webserver, &config))
   {
      revk_web_settings_add (webserver);
      register_get_uri ("/", web_root);
   }
   revk_gpio_output (pwr3, 0);
   revk_gpio_output (pwr5, 0);
   {                            // LED
      led_strip_config_t strip_config = {
         .strip_gpio_num = led.num,
         .max_leds = MANIFESTS + 1,
         .color_component_format = LED_STRIP_COLOR_COMPONENT_FMT_GRB,
         .led_model = LED_MODEL_WS2812, // LED strip model
         .flags.invert_out = led.invert,
      };
      led_strip_rmt_config_t rmt_config = {
         .clk_src = RMT_CLK_SRC_DEFAULT,        // different clock source can lead to different power consumption
         .resolution_hz = 10 * 1000 * 1000,     // 10 MHz
      };
#ifdef	CONFIG_IDF_TARGET_ESP32S3
      rmt_config.flags.with_dma = true;
#endif
      REVK_ERR_CHECK (led_strip_new_rmt_device (&strip_config, &rmt_config, &strip));
      revk_task ("led", led_task, NULL, 4);
   }
   revk_gpio_input (btn);
   revk_task ("btn", btn_task, NULL, 4);
   revk_task ("flash", flash_task, NULL, 16);
}
